#!/bin/bash 
 # return-test.sh 

# 一个函数最大可能返回的值是255. 

return_test () # 无论传给函数什么都返回它. 
{ 
return $1 
} 
 
 return_test 27 # o.k. 
 echo $? # 返回27. 
 
 return_test 255 # 仍然o.k. 
 echo $? # 返回255. 
 
 return_test 257 # 错误! 
 echo $? # 返回1 (返回代码指示错误). 
 
 # ====================================================== 
 return_test -151896     # 能够返回这个非常大的负数么? 
 echo $? # 会返回-151896? 
 # 不! 它将返回168. 
 #   2.05b版本之前的Bash是允许
 #+ 超大负整数作为返回值的. 
 #  但是比它更新一点的版本修正了这个漏洞. 
 #  这将破坏比较老的脚本. 
 #  慎用! 
 # ====================================================== 
 
 exit 0 
